DESIGNER/Enums/КачествоРешенияЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>КачествоРешенияЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Великолепно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удовлетворительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТяпЛяп</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DESIGNER/Enums/КачествоРешенияЗадачи/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
     	
#Область ПрограммныйИнтерфейс

// Формирует цвет в зависимости от переданного качества решения
//
// Параметры:
//  Качество - ПеречислениеСсылка.КачествоРешенияЗадачи - Качество.
//
// Возвращаемое значение:
//  Цвет - цвет
//
Функция ЦветКачестваРешения(Качество) Экспорт
	
	Если Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.Великолепно") Тогда
	
		Цвет = WebЦвета.ЦветМорскойВолны;	
	
	ИначеЕсли Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.Удовлетворительно") Тогда
		
		Цвет = WebЦвета.СветлоЗолотистый;	

	ИначеЕсли Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.ТяпЛяп") Тогда
		
		Цвет = WebЦвета.Томатный;	
		
	Иначе
	
		Цвет = WebЦвета.Серый;	
	
	КонецЕсли;
	
	Возврат Цвет;	

КонецФункции 

#КонецОбласти

#КонецЕсли
